Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: ང་ལ་དབེན་པ་ཡིན་ཏེ། དམ་པའི་ཆོས་ཀྱི་ཕྱིར་རང་གི་སྲོག་གི་བསམ་པ་ཡང་བཏང་།
en: For the sake of the sacred Dharma, they will abandon thinking of their own lives.

source: ནོར་དང་བཅས་པ་དང་། བུ་དང་བཅས་པ་དང་། ཆུང་མ་དང་བཅས་པ་དང་། བུ་མོ་དང་བཅས་པའི་སྡེ་ཕྱོགས་རྣམས་ཀྱི་སྲོག་གི་བསམ་པ་ཡང་བཏང་ནས་དམག་གི་དཔུང་ཆེན་པོའི་གཡུལ་དུ་འཇུག་ཅིང་།
en: They will abandon their wealth and any thoughts of the lives of their own groups, including their sons, their wives, and their daughters.

source: དམག་གི་དཔུང་ཆེན་པོའི་གཡུལ་ཟད་པར་བྱེད་དོ། །བདུད་ཀྱི་ཕྱོགས་ཀྱི་སྟོབས་འཇོམས་པར་བྱེད་དོ། །བདུད་ཀྱི་སྟོབས་རྣམ་པར་འཇིག་པར་བྱེད་དོ།
en: Having done so, they will enter into battle with the great army, complete their battle with the great army, and defeat the powerful forces of Māra, completely destroying the forces of Māra.

source: །ཇི་ལྟ་བུའི་ཐབས་ཀྱིས་ཀྱང་དམ་པའི་ཆོས་འཛུགས་པར་བྱེད་དེ། ངའི་དམ་པའི་ཆོས་ཀྱི་མཐུ་ཡང་སྐྱེད་པར་འགྱུར་རོ།
en: They will firmly establish the sacred Dharma through all manner of skillful means and arouse the power of my sacred Dharma.

source: །སེམས་ཅན་ཆེན་པོ་དེ་དག་གིས་ནི་རྙེད་པ་ལེགས་པར་རྙེད་པར་འགྱུར་ཏེ།
en: These sentient beings will obtain that which is well obtained.

source: དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་མི་མཆོག་ཡིན་པར་བལྟ་བར་བྱའོ།
en: They should be regarded as supreme beings and bodhisattvas.

source: །དགེ་སློང་ངམ། དགེ་སློང་མ་དེ་དག་ནི་སྦྱིན་གནས་ཡོངས་སུ་དག་པར་འགྱུར་རོ། །དགེ་འདུན་ཡོངས་སུ་དག་པར་ཡང་འགྱུར་རོ།
en: Those monks and nuns will become completely pure objects of generosity and will form a completely pure saṅgha.

source: །དགེ་བསྙེན་གྱི་སྡེ་ཚན་དང་། དགེ་བསྙེན་མའི་སྡེ་ཚན་དེ་དག་ནི་སངས་རྒྱས་འབྱུང་བ་དང་ཕྲད་པར་འགྱུར།
en: Those groups of laymen and laywomen will encounter the advent of buddhas.

source: དམ་པའི་ཆོས་ལ་ཡང་ནན་ཏན་དུ་སྒྲུབ་པར་འགྱུར་མོད་ཀྱི། འོན་ཀྱང་མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་ངའི་ཉན་ཐོས་ཀྱི་ཚིག་ལ་ཡིད་ཆེས་པའི་སེམས་ཅན་དེ་དག་ནི་ཉུང་སྟེ། ཤིན་ཏུ་ཕལ་ཆེར་ནི་མོས་པར་མི་འགྱུར་རོ།
en: Although they will earnestly practice the sacred Dharma, Gandharva King Delightful Appearance, nevertheless those sentient beings who trust in the words of my disciple will be few; the vast majority will not develop conviction in them. “

source: །མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་རྣམ་པ་བཞི་དང་ལྡན་ན་ངའི་ཉན་ཐོས་དེ་བཞིན་གཤེགས་པ་དང་མིང་འཐུན་པའི་དགེ་སློང་གི་ཚིག་ལ་ཡིད་ཆེས་པར་འགྱུར་ཏེ།
en: Gandharva King Delightful Appearance, those who possess four qualities will trust in the words of my disciple, this monk who is named after the Tathāgata.

source: བཞི་གང་ཞེ་ན།
en: What are these four?

source: སྔོན་གྱི་མཐར་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྔ་མ་རྣམས་ལས་ཟབ་མོ་བརྟན་པའི་ཆུའི་རྒྱ་མཚོའི་དུས་ཚོད་ཀྱི་ཏིང་ངེ་འཛིན་འདི་ཐོས་པ་དང་།
en: They will have heard of this samādhi of the tide of the deep, constant ocean from many former buddhas in the past.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་གཟུང་བ་དང་།
en: They will be fully supported by spiritual friends.

source: ལྷག་པའི་བསམ་པ་ལ་ཞུགས་ཤིང་དགེ་བའི་རྩ་བ་ཉེ་བར་བརྟན་པ་དང་།
en: They will abide in the superior intention and will be supported by virtuous roots.

source: རྒྱ་ཆེན་པོ་ལ་མོས་པ་ལུས་ཀྱིས་མངོན་སུམ་དུ་བྱས་པ་སྟེ།
en: They will directly manifest vast conviction with their bodies.

source: མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་རྣམ་པ་བཞི་པོ་དེ་དག་གིས་ན་ངའི་ཉན་ཐོས་ཀྱི་ཚིག་ལ་ཡིད་ཆེས་པར་འགྱུར་རོ།
en: Gandharva King Delightful Appearance, those who possess these four qualities will trust in the words of my disciple.

source: །གང་དག་ཡིད་མི་ཆེས་པ་དེ་དག་ཐམས་ཅད་ནི་བདུད་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་མི་གཏི་མུག་ཅན་ཡིན་པར་རིག་པར་བྱའོ།
en: You should know that those who do not trust in them are ignorant people who are under the enchanting power of Māra.

source: །སེམས་ཅན་གང་དག་མོས་པར་འགྱུར་བ་དེ་དག་ནི་སངས་རྒྱས་མང་པོས་ཡོངས་སུ་གཟུང་བ་ཡིན་པར་རིག་པར་བྱའོ།
en: You should know that any sentient beings who do develop trust in them will be fully supported by the myriad buddhas.

source: །ཀྱེ་མ་མ་འོངས་པའི་སེམས་ཅན་རྣམས་ནི་སངས་རྒྱས་འབྱུང་བ་ཐམས་ཅད་དང་ཕྲད་པར་འགྱུར་རོ།
en: Ah! These future sentient beings will encounter the advent of all the buddhas.

source: དེ་བཞིན་གཤེགས་པ་དང་མིང་འཐུན་པའི་དགེ་སློང་སངས་རྒྱས་མང་པོས་ཡོངས་སུ་གཟུང་བ་ནི་འཁོར་ཤིན་ཏུ་རྣམ་པར་དག་པ་དང་། དགེ་སློང་གི་ཚོགས་དང་། དགེ་སློང་མའི་ཚོགས་དང་ལྡན་པའི་ཕྱིར་རོ།
en: This monk who is named after the Tathāgata will be completely supported by many buddhas because his companions will be utterly pure and will include the assembly of monks and nuns.

source: །གང་དག་ངའི་ཚིག་ལ་མངོན་པར་ཡིད་ཆེས་པ་དེ་དག་ནི་རྡོ་རྗེའི་རང་བཞིན་ཡིན་པར་རིག་པར་བྱའོ།
en: You should know that those who trust in my words will possess natures like vajras. “

source: །མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དང་མིང་འཐུན་པའི་དགེ་སློང་གི་ཆེ་བ་ཉིད་ལ་ལྟོས།
en: Furthermore, Gandharva King Delightful Appearance, behold the greatness of this monk who is named after the Tathāgata!

source: གང་གི་ཕྱིར་དགེ་སློང་དེ་ནི་དེ་བཞིན་གཤེགས་པ་ཀླུའི་རིགས་སྒྲོན་མའི་ཐད་དུ་དམ་བཅས་ཤིང་སྨོན་ལམ་བཏབ་ལ། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་བསྟན་པ་ལ་ཡང་དམ་པའི་ཆོས་བསྲུང་བའི་ཕྱིར་བདག་གི་སྲོག་ཡོངས་སུ་བཏང་ངོ་།
en: Why? That monk made the vow and aspiration before the tathāgata Lamp of the Nāga Family that ‘I will completely sacrifice my own life in order to guard the sacred Dharma, the teachings of the Bhagavān Śākyamuni.’

source: །ཞེས་བྱས་ནས་དམ་པའི་ཆོས་ཀྱི་སྒྲ་ལན་གསུམ་དུ་མངོན་པར་བསྒྲགས་པས་ན་འདས་པའི་དུས་ན་ཡང་ངའི་ཉན་ཐོས་དཀའ་བ་བྱེད་བྱེད་པ་ཡིན་ལ་ད་ལྟར་ཡང་དཀའ་བ་བྱེད་པ་ཡིན་ནོ།
en: After that, he actually sounded the roar of the sacred Dharma three times. In past times, this disciple of mine engaged in the conduct that is difficult, and in the present, he again engages in the conduct that is difficult.

source: །རྒྱལ་པོ་བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུ་དེ་ནི་ད་ལྟར་ལིད་ཙ་བཱི་གཞོན་ནུ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མཐོང་ན་དགའ་བ་འདི་ཡིན་ནོ།
en: King Great Diligent Nāga is now the present-day Licchavi youth Admired by All Worlds.

source: །ལིད་ཙ་བཱིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་དང་མིང་འཐུན་པའི་དགེ་སློང་དུ་འགྱུར་བར་རིག་པར་བྱའོ།
en: You should know that this Licchavi youth will become the monk who is named after the Tathāgata. “

source: །མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དང་མིང་འཐུན་པའི་དགེ་སློང་གི་ཆེ་བ་ཉིད་རྣམ་པར་དག་པ་ལ་ལྟོས།
en: Again, Gandharva King Delightful Appearance, behold the greatness of this monk who is named after the Tathāgata!

source: དགེ་སློང་དེ་ལ་སེམས་ཅན་གང་དག་གིས་བསྙེན་བཀུར་བྱས་པ་དེ་དག་གིས་ནི་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་བསྐལ་པ་གྲངས་མེད་པར་བསྙེན་བཀུར་བྱས་པ་ཡིན་ནོ།
en: Those sentient beings who venerate that monk will have venerated all tathāgatas who appear in the past, future, and present over innumerable eons.

source: །སེམས་ཅན་གང་དག་གིས་དགེ་སློང་འདོད་པ་དེ་ལ་བཀུར་སྟིར་བྱ་བ་དང་། བླ་མ་ལ་རིམ་གྲོ་བྱ་བས་རྟག་ཏུ་མཆོད་པ་བྱེད་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པ་བྱས་པ་ཡིན་ནོ། །དགེ་སློང་ངམ།
en: Sentient beings who pay respect to that one who desires to be a monk and those who constantly make offerings by honoring him as their guru will have made offerings to all tathāgatas.

source: དགེ་སློང་མ་འམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་དག་གིས་རང་གི་སྲོག་གི་བསམ་པ་ཡོངས་སུ་བཏང་སྟེ། དགེ་སློང་འདོད་པ་དེའི་ཐད་དུ་ངན་ངོན་གྱིས་ཆོག་པར་འཛིན་ཅིང་གནས་པར་བྱེད་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་བླ་མ་ལ་ཤིན་ཏུ་རིམ་གྲོར་བྱ་བ་ཕུལ་བ་ཡིན་ནོ། །དགེ་སློང་ངམ།
en: Monks, nuns, laymen, and laywomen who abandon thinking of their own lives and who support that one who desires to be a monk by providing him with basic supplies and housing will have offered to honor all the tathāgatas as gurus.

source: དགེ་སློང་མ་འམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་དག་དགེ་སློང་འདོད་པ་དེས་བསྒོ་བ་བཞིན་བྱེད་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བཀའ་བཞིན་དུ་བྱས་པ་ཡིན་ནོ། །དགེ་སློང་ངམ།
en: Monks, nuns, laymen, and laywomen who follow the instructions of that one who desires to be a monk will be carrying out the commands of all the tathāgatas.

source: དགེ་སློང་མ་འམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་དག་གིས་སྡང་བ་མེད་པའི་སེམས་ཀྱིས་དགེ་སློང་དེ་ལས་དམ་པའི་ཆོས་བཤད་པ་དང་། མཉན་པ་དང་། འབེལ་བའི་གཏམ་གྱི་ཁུར་བླངས་ནས་སྟོན་པར་བྱེད་པ་དེ་ནི་ཐབས་ཀྱི་སྲས་བསླབ་པ་ལ་གུས་པ་སྒྲ་གཅན་ཟིན་དང་འདྲ་བར་བལྟ་བར་བྱའོ།
en: Monks, nuns, laymen, and laywomen who, with minds free from hatred, listen to that monk explain the sacred Dharma, take up the burden of his elaborate explanations, and explain them to others should be seen as being like Rāhula—children of skillful means who are devoted to the trainings. “

source: །དགེ་སློང་གིས་ལུང་བསྟན་པ་འདི་ཐོས་ནས་སེམས་ཅན་བསོད་ནམས་ཆུང་བ་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་རྣམས་འདི་སྙམ་དུ་སེམས་བསྐྱེད་པར་འགྱུར་ཏེ།
en: Those sentient beings with little merit—monks, nuns, laymen, and laywomen—who hear this prophecy will think,

source: ཀྱེ་མ་དགེ་སློང་ལྟར་བཅོས་པ་དེ་བཞིན་གཤེགས་པ་དང་མིང་འཐུན་པའི་དགེ་སློང་འདིས་ནི་སྤྲིན་ཆེན་པོའི་མདོ་སངས་རྒྱས་ཀྱིས་མ་གསུངས་པར་བདག་ཉིད་ཀྱིས་བྱས་ནས་བདག་ཉིད་ལུང་བསྟན་པ་ཡང་བཅུག་སྟེ།
en: ‘Ah! This monk named after the Tathāgata is a counterfeit monk. He himself composed this Great Cloud discourse, which was not spoken by the Buddha, inserting within it a prophecy about himself.

source: སངས་རྒྱས་ཀྱིས་མ་གསུངས་པར་རང་བཟོའི་བསླབ་པའི་གཞི་ཐ་དད་པ་བདག་ཉིད་ཀྱིས་བསྟན་པ་འཆད་པར་བྱེད་དོ།
en: He gives his own teachings on basic precepts that he himself fabricated and that were not spoken by the Buddha.

source: །ཚེ་དང་ལྡན་པ་དག་ད་དགེ་སློང་འདི་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་ཏེ།
en: Now, venerables, this monk is mistaken.

source: ཚེ་དང་ལྡན་པ་དག་འོ་བུ་ཅག་ནི་བྲན་ཕོ་དང་། བྲན་མོ་དང་། བ་ལང་དང་། མ་ཧེ་ལ་སོགས་པ་ཡོངས་སུ་འཛིན་པ་ཡིན་ནོ་ཞེའོ། །དེས་ནི་ཁྱེད་དང་བདག་ཅག་སྤངས་པ་ཡིན་ནོ།
en: Venerables, he says that we keep male and female servants, cows, and water buffalo, and that these should all be abandoned.

source: །དགེ་སློང་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་འདིའི་ཚིག་གིས་ན་འོ་བུ་ཅག་གིས་སྲོག་དང་བསྡོས་ཏེ། འདིའི་ཕྱོགས་བླངས་ནས་ཁྱེད་དང་བདག་ཅག་གིས་ཀྱང་མཆོག་ཏུ་དཀའ་བ་བྱེད་པར་འགྱུར་སྐད་ལོ།
en: This misguided monk thus claims that we should dedicate our lives, take up his positions, and then engage in the conduct that is extremely difficult.

source: །འདི་ལ་ཅི་བྱས་པ་དང་། ཅི་བྱིན་པའི་རྣམས་ནི་ཚེ་འདི་དང་། ཚེ་ཕྱི་མ་ལ་བདག་ཅག་གིས་ཉམས་སུ་མྱོང་བར་འགྱུར་བ་ཙམ་ཚོད་ན་ཇི་ལྟར་བྱ་ཞེས་སྟིང་ཞིང་ལྐོག་ཏུ་སོང་ནས་ཕན་ཚུན་དབྱེན་བྱེད་པར་འགྱུར་ཏེ།
en: If whatever we do or give will only produce results experienced in this life and the next, then what should we do?’

source: སེམས་ཅན་དེ་དག་ནི་མུན་པའི་དབང་དུ་གྱུར་ཅིང་བསོད་ནམས་ཆུང་བ་ཡིན་པར་རིག་པར་བྱའོ།
en: Speaking in this way, they criticize him, and meeting together in private, they sow discord. You should know that these sentient beings are under the power of darkness and have little merit. “

source: །མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་སྤྲིན་ཆེན་པོའི་མདོ་རྟོགས་པར་དཀའ་བ་ལ་ལྟོས།
en: Gandharva King Delightful Appearance, see how difficult it is to realize this Great Cloud discourse!

source: སེམས་ཅན་གང་དག་དགེ་བའི་རྩ་བ་བྱས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཐབས་ལ་བརྟེན་པའི་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་དག་ངའི་ཉན་ཐོས་ཀྱི་ལུང་བསྟན་པ་ཐོས་ན་འདི་ལྟར་སེམས་བསྐྱེད་དེ།
en: Sentient beings who have created virtuous roots—monks, nuns, laymen, or lay women who rely on the skillful means of the bodhisattvas—and who hear the prophecies of my disciple will produce the thought,

source: ཀྱེ་མ་དགེ་སློང་མཁས་པ་འདི་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་མ་ཡིན་དུ་ཟིན་ན་སྐྱེ་བོ་ཕལ་པས་རྒྱ་མཚོ་ཆེན་པོ་འདི་ལྟ་བུ་དཀྲུག་པར་ག་ལ་ནུས།
en: ‘Ah! If it is held that even this wise monk is not a bodhisattva, then what power will ordinary sentient beings have within this great turbulent ocean of cyclic existence?

source: ཚེ་དང་ལྡན་པ་དག་ཁྱེད་དང་བདག་ཅག་དེའི་གཏམ་ཟླར་གྱུར་ན་ནི་བདག་ཅག་གིས་སྐྱེས་པ་དང་། འཚོ་བ་དང་། རབ་ཏུ་བྱུང་བའི་འབྲས་བུ་རྙེད་པ་ལེགས་པར་རྙེད་དོ།
en: Venerables, if we familiarize ourselves with his words, we will obtain well the fruition of birth, life, and going forth to renunciation.

source: །དེ་ནི་སའི་སྟེང་དུ་གྲགས་པའི་དེ་བཞིན་གཤེགས་པའི་ཞབས་ཀྱི་དྲུང་ནས་ལུང་བསྟན་པ་ཐོབ་ཅིང་། ལྷའི་མིག་གིས་ལེགས་པར་མཐོང་བའི་ཆོས་ཐོབ་པ་ཡིན་ནོ་ཞེས་གྲག་པས་བདག་ཅག་གིས་སྲོག་གི་བསམ་པ་ཡོངས་སུ་བཏང་ལ།
en: That monk is renowned for obtaining a prophecy at the feet of the Tathāgata, who is renowned across the land, and for obtaining the Dharma that can be well seen with the divine eye.

source: འདི་བདག་ཅག་ལ་སྟོན་པའི་སློབ་དཔོན་དུ་བྱ་སྟེ། ཆོས་བསྟན་པ་གཟུང་བའི་རིགས་སོ།
en: Therefore, it would be best if we were to give up thinking of our own lives, take him as our master, and uphold his Dharma teachings.

source: །བདག་ཅག་བཞི་ཡང་རུང་། གསུམ་ཡང་རུང་སྟེ། སློབ་དཔོན་གྱི་གྲོགས་བྱའོ།
en: Whether just three or four of us, we should become followers of the master.

source: །ཚེ་དང་ལྡན་པ་དག་དམ་པའི་ཆོས་དབྱུང་བའི་ཕྱིར་ནི་སྲོག་ཡོངས་སུ་གཏང་ཡང་སླའོ་ཞེས་ཟེར་རོ།
en: Venerables, it is quite easy to sacrifice our lives so that the sacred Dharma may appear.’ “

source: །མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་དེའི་ཚེ་དམ་པའི་ཆོས་ལ་དགའ་བའི་རིགས་ཀྱི་བུ་དེ་དག་ལ་ཀུན་ཏུ་བསྲུང་བར་གྱིས་ཤིག །
en: Gandharva King Delightful Appearance, at that time, you must completely guard those noble children who delight in the sacred Dharma.

source: རིགས་ཀྱི་བུ་གང་དག་ཆོས་འདོད་པ་དང་། དགེ་སློང་ངམ། དགེ་སློང་མ་འམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་མང་པོ་ཡང་རུང་། གཉིས་ཀྱང་རུང་། གཅིག་ཀྱང་རུང་སྟེ།
en: Those noble children who desire the Dharma—monks, nuns, laymen, or laywomen, whether they be many or just one or two—will, on having heard the prophecies of my disciple, adopt the positions of his Dharma teaching.

source: ངའི་ཉན་ཐོས་ལུང་བསྟན་པ་ཐོས་ནས་ངའི་ཉན་ཐོས་ཆོས་སྟོན་པའི་ཕྱོགས་བྱ་བའི་ཕྱིར་འཁོད་པའི་སེམས་ཅན་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ཐམས་ཅད་ཀྱི་ཕྱོགས་དང་། དམ་པའི་ཆོས་འཛུགས་པ་ཡིན་ནོ།
en: Thus, they will have adopted the position of all the practices of all the tathāgatas and established themselves in the sacred Dharma.

source: །སེམས་ཅན་དེ་དག་ནི་ལྷ་མ་ཡིན་གྱི་དབང་པོའི་ཡུལ་མ་ཡིན་པའི་ལུས་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་ལུས་དང་ལྡན་ཞིང་གཟུགས་ཐམས་ཅད་ཡང་དག་པར་མཐོང་བ་ཡིན་ནོ།
en: These sentient beings will have bodies that cannot be perceived by the sense faculties of asuras—inconceivable bodies—and yet they will correctly see all forms. “

source: །མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་གཞན་ཡང་ངའི་ཉན་ཐོས་དེ་བཞིན་གཤེགས་པ་དང་མིང་འཐུན་པའི་དགེ་སློང་ཆོས་ཀྱི་སྒྲ་ཆེན་པོ་ལན་གསུམ་མངོན་པར་བསྒྲགས་ནས་འཆི་བའི་དུས་བྱེད་པར་འགྱུར་བའི་ཆེ་བ་ཉིད་ལ་ལྟོས།
en: Furthermore, Gandharva King Delightful Appearance, my disciple, the monk who is named after the Tathāgata, will sound the great roar of Dharma three times, and then the time for him to die will come—behold his greatness!

source: མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་དེའི་ཚེ་ངའི་དམ་པའི་ཆོས་ཀྱི་ཕྱོགས་ནུབ་པར་འགྱུར་རོ།
en: At that time, Gandharva King Delightful Appearance, the assembly of my sacred Dharma will decline.

source: །དེ་ནི་མཐའ་མར་འབྱུང་བར་འགྱུར་ལ། དེ་དང་འདྲ་བའི་སེམས་ཅན་གཞན་མེད་དེ་མི་སྲིད་དོ།
en: When the end arrives, there will be no other sentient beings like him—they will not exist.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་དགེ་སློང་དེ་འདི་ནས་ཤི་འཕོས་ནས་གང་དུ་སྐྱེ་བར་འགྱུར།
en: Bhagavān, after dying here, where will that monk go on to be reborn?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་ངའི་ཉན་ཐོས་དེ་ནི་འདི་ནས་ཤི་འཕོས་ནས་སངས་རྒྱས་སུ་འགྱུར་རོ།
en: The Bhagavān replied, “Gandharva King Delightful Appearance, after my disciple dies here, he will go on to become a buddha.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་སེམས་ཅན་ཐམས་ཅད་ལ་སྨན་པའི་སླད་དུ་བཤད་དུ་གསོལ། བཀའ་སྩལ་པ།
en: Bhagavān, I beseech you to explain this, to serve as medicine for sentient beings.” “

source: རིགས་ཀྱི་བུ་ལེགས་སོ། །ལེགས་སོ།
en: Excellent, noble child, excellent.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ལེགས་ཀྱིས་རིགས་ཀྱི་བུ་ངའི་ཉན་ཐོས་ཀྱི་ཆེ་བ་ཉིད་ཉོན་ཅིག །
en: Listen well, noble child, as I explain to you the greatness of my disciple.

source: རིགས་ཀྱི་བུ་བསྐལ་པ་བཟང་པོ་འདི་འདས་ཏེ། སངས་རྒྱས་སྟོང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་བསྐལ་པ་དྲུག་ཅུ་རྩ་གཉིས་སུ་སངས་རྒྱས་འབྱུང་བར་མི་འགྱུར་ཏེ།
en: Noble child, after this Fortunate Eon has passed and a thousand buddhas have gone on to parinirvāṇa, sixty-two eons will pass in which no buddhas will appear.

source: རང་སངས་རྒྱས་བྱེ་བ་ཕྲག་འབུམ་འབྱུང་བར་འགྱུར་རོ།
en: During this time, one trillion pratyekabuddhas will appear.

source: །རིགས་ཀྱི་བུ་བསྐལ་པ་དྲུག་ཅུ་རྩ་གཉིས་པོ་དེ་དག་འདས་ནས་སངས་རྒྱས་གཞན་བདུན་འབྱུང་བར་འགྱུར་རོ།
en: Noble child, after those sixty-two eons have passed, another seven buddhas will arise.

source: །དེ་ནས་བདུན་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེའི་ཚེ་དེའི་དུས་ན་འཇིག་རྟེན་གྱི་ཁམས་འདི་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དང་བ་ཞེས་བྱ་བར་འགྱུར་ཏེ།
en: When those seven buddhas have gone on to parinirvāṇa, then at that time this world system will become known as Manifest Clarity.

source: འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དང་བ་དེར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡེ་ཤེས་འབྱུང་གནས་འོད་ཅེས་བྱ་བར་འགྱུར་རོ།
en: Within this world system of Manifest Clarity there will arise a bhagavān, tathāgata, foe-destroyer, complete and perfect buddha named Radiant Source of Gnosis.

source: །དེ་བཞིན་གཤེགས་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་སེམས་ཅན་འཁོད་པ་དེ་དག་ཐམས་ཅད་མཛེས་པར་འགྱུར་ཞིང་དང་བ་ཐོབ་པར་འགྱུར་རོ།
en: The sentient beings who dwell within that Tathāgata’s buddhafield will be beautiful and will have obtained clarity.

source: །གང་དག་དམ་པའི་ཆོས་ཀྱི་ཕྱོགས་བྱེད་པ་དང་། དམ་པའི་ཆོས་འབྱུང་བར་བྱེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དེའི་ཚེ་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དང་བ་དེར་སྐྱེ་བར་འགྱུར་རོ།
en: At that time, all those who take the side of the sacred Dharma or cause the sacred Dharma to appear will take birth within this world system of Manifest Clarity.

source: །དེར་སྐྱེས་ནས་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་འབྱུང་གནས་འོད་དེའི་ཉན་ཐོས་ཀྱི་མཆོག་ཏུ་འགྱུར་ཏེ། དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་མི་མཆོག་ཏུ་འགྱུར་རོ།
en: Having been born there, they will become supreme disciples of that bhagavān tathāgata Radiant Source of Gnosis, and they will all become bodhisattvas, supreme humans.

source: །དེ་ན་སེམས་ཅན་སུ་ལ་ཡང་འདོད་ཆགས་ཀྱི་སེམས་ཀུན་ནས་ལྡང་བ་འབྱུང་བར་མི་འགྱུར་རོ།
en: At that time, for all sentient beings, thoughts of desire will cease to arise.

source: །ཞེ་སྡང་གི་སེམས་ཀུན་ནས་ལྡང་བ་འབྱུང་བར་མི་འགྱུར་རོ།
en: Thoughts of anger will cease to arise.

source: །གཏི་མུག་གི་སེམས་ཀུན་ནས་ལྡང་བ་འབྱུང་བར་མི་འགྱུར་རོ།
en: Thoughts of ignorance will cease to arise.

source: །སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་ཆོས་ལ་དད་པ་ཐོབ་ཅིང་ཆོས་སྤྱོད་པར་འགྱུར་རོ།
en: All those sentient beings will gain faith in the Dharma and will practice the Dharma. “

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡེ་ཤེས་འབྱུང་གནས་འོད་ཀྱི་ཚེའི་ཚད་ནི་བར་གྱི་བསྐལ་པ་བཅྭ་ལྔར་འགྱུར་རོ།
en: The tathāgata, foe-destroyer, complete and perfect buddha Radiant Source of Gnosis will have a lifespan of fifteen intermediate eons.

source: །སེམས་ཅན་རྣམས་ཀྱང་ཐེག་པ་གསུམ་གྱིས་ངེས་པར་འབྱུང་བར་འགྱུར་རོ།
en: All sentient beings will attain emancipation through the three vehicles.

source: །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་ཚད་མེད་དེ།
en: Bodhisattvas will be innumerable.

source: རིགས་ཀྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་བདུད་དང་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་འབྱུང་བ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པར་འགྱུར་ཏེ། སེམས་ཅན་ལ་སྙིང་བརྩེ་བར་གནས་སོ།
en: At that time, noble child, all māras and gods belonging to the faction of Māra will come to abide in the Great Vehicle and be steeped in compassion for sentient beings.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ངན་སོང་གསུམ་ཡང་མེད་དོ།
en: In that buddhafield, the three unpleasant rebirths will not exist.

source: །མི་ཁོམ་པ་བརྒྱད་ཀྱང་མེད་དེ་རྟག་ཏུ་བརྒྱན་པར་འགྱུར་ལ། བྱང་གི་སྒྲ་མི་སྙན་གྱི་གླིང་དང་འདྲའོ།
en: The eight unfree states will not exist. It will be constantly adorned, like the northern continent of Uttarakuru.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེར་བདུད་དང་ཕྱིར་རྒོལ་བ་ཡང་བཅོམ་པར་འགྱུར་རོ།
en: In that buddhafield, all māras and hostile forces will be vanquished.

source: །ལྟ་བ་ཐམས་ཅད་ཀྱང་མེད་དོ།
en: All metaphysical views will no longer exist.

source: །བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་བདེ་བར་གཤེགས་པས་གསུངས་པའི་དམ་པའི་ཆོས་ལོ་བྱེ་བ་ཕྲག་སྟོང་དུ་གནས་པར་འགྱུར་རོ།
en: After the Bhagavān passes into parinirvāṇa, the sacred Dharma spoken by the Tathāgata will remain for a trillion years. “

source: །དེ་ནས་དེའི་ཚེ་འཁོར་ཆེན་པོའི་ནང་ནས་ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དུ་མས་དེ་བཞིན་གཤེགས་པ་ལ་མེ་ཏོག་སིལ་མས་གཏོར་ཏོ། །སིལ་སྙན་ཀྱང་དཀྲོལ་ཏོ། །ཙན་དན་གྱི་ཕྱེ་མ་དང་། བྱུག་པ་དག་གིས་ཀྱང་གཏོར་ཏོ། །
en: At that time, many asuras, garuḍas, kinnaras, and mahoragas will go forth from the great assembly, throwing flowers, playing cymbals, and lavishing sandalwood powders and ointments on the Tathāgata.

source: ཉན་ཐོས་ཆེན་པོ་དེ་དག་གིས་རང་རང་གི་བླ་གོས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་གསོལ་ཏོ། །
en: Each of the great disciples will take his own outer robe and place it on the Tathāgata’s body.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ཀྱང་མེ་ཏོག་གི་རིམ་པ་རི་རབ་ཙམ་དང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། ཕྱེ་མ་དང་། སྤོས་དང་། བྱུག་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་བསམ་གྱིས་མི་ཁྱབ་པའི་མཆོད་པའི་ལས་བྱས་ནས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་འབྱུང་གནས་འོད་དེའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་སེམས་བསྐྱེད་དོ།
en: The bodhisattvas will make inconceivable offerings to the Bhagavān of flowers piled as high as Mount Meru, flower garlands, powders, incense, and ointments, and they will produce the aspiration to engage in the bodhisattva conduct of the tathāgata Radiant Source of Gnosis.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་སྙིང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then, the bodhisattva Great Cloud Essence addressed the Bhagavān, saying,

source: །ཀྱེ་མ་བཅོམ་ལྡན་འདས་ཟབ་མོ་བརྟན་པའི་ཆུའི་རྒྱ་མཚོའི་དུས་ཚོད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་ཡུལ་འདི་མ་འོངས་པའི་སེམས་ཅན་བསོད་ནམས་ཆུང་ངུ་རྣམས་ལ་སངས་རྒྱས་མང་པོ་འབྱུང་བར་བགྱིད་ཅིང་།
en: “Ah, Bhagavān! This domain of the samādhi of the tide of the deep, constant ocean will cause many buddhas to appear in the future for those sentient beings with little merit.

source: དགེ་བའི་རྩ་བ་ཚུལ་བཞིན་དུ་བགྱིས་པའི་སེམས་ཅན་རྣམས་ལུང་བསྟན་པས་ལུང་སྟོན་པར་བགྱིད་པ་ནི་ངོ་མཚར་ཏོ།
en: Having properly cultivated virtuous roots, sentient beings will receive prophecies—how amazing!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྤྲིན་ཆེན་སྙིང་པོ་མ་འོངས་པའི་སེམས་ཅན་རྣམས་བསོད་ནམས་ཆུང་ཞེས་དེ་སྐད་མ་ཟེར་ཅིག །
en: The Bhagavān replied, “Great Cloud Essence, you should not say ‘sentient beings with little merit.’

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why?

source: སྤྲིན་ཆེན་སྙིང་པོ་སངས་རྒྱས་འབྱུང་བ་ནི་དཀོན་ནོ། །སྤྲིན་ཆེན་པོའི་མདོ་འདི་ནི་དེ་བས་ཀྱང་ཆེས་དཀོན་ནོ། །སྤྲིན་ཆེན་པོའི་མདོ་འདི་ལས་ཏིང་ངེ་འཛིན་ནམ། གཟུངས་སམ། ཚིགས་སུ་བཅད་པ་གང་ཡང་རུང་བའི་ཚིག་གི་ཕྱེད་ཐོས་ནས་ཡིད་ཆེས་པར་བྱེད་པ་གང་ཡིན་པའི་སེམས་ཅན་དེ་དག་ཀྱང་ཆེས་དཀོན་པ་ཡིན་ནོ་ཞེས་ང་སྨྲ་སྟེ།
en: Great Cloud Essence, I would say that the arising of buddhas is rare, this Great Cloud discourse is rarer, and sentient beings who hear and cherish the samādhis, dhāraṇīs, or even just portions of verses from this Great Cloud discourse are even rarer still.

source: དེ་བས་ན་མ་འོངས་པའི་སེམས་ཅན་རྣམས་ནི་བསོད་ནམས་ཆུང་བ་མ་ཡིན་ནོ་ཞེས་ང་སྨྲའོ།
en: Therefore, I would not say that these future sentient beings have little merit.

source: །སྤྲིན་ཆེན་སྙིང་པོ་གཞན་ཡང་མ་འོངས་པའི་སེམས་ཅན་གང་དག་སྤྲིན་ཆེན་པོའི་མདོ་འདི་ལས་ཚིགས་སུ་བཅད་པའམ། ཚིག་གི་ཕྱེད་ཐོས་ན་ཡིད་ཆེས་པར་བྱེད་པའི་སེམས་ཅན་དེ་དག་ལས་གུད་ན་ཆེས་དཀོན་པ་མེད་དོ་ཞེས་ང་སྨྲའོ།
en: Furthermore, Great Cloud Essence, I would say that apart from those future sentient beings who hear and cherish a verse or just a portion of a verse from this Great Cloud discourse, there is nothing rarer.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཅི་ལ་དགོངས་ཏེ་དེ་སྐད་བཀའ་སྩལ།
en: Bhagavān, what does the Tathāgata mean by giving such a reply?” “

source: བཀའ་སྩལ་པ། དེ་བཞིན་གཤེགས་པའི་གསུངས་པའི་མདོ་ལས་ཚིག་གམ། ཚིག་གི་ཕྱེད་ལ་ཡང་ཡིད་ཆེས་པར་བྱེད་པ་གང་ཡིན་པ་དེ་དག་ལས་གུད་ན་ཆེས་དཀོན་པ་མེད་དོ། །ཞེས་ང་སྨྲ་བ་དེ་ལ་ཐེ་ཙོམ་མེད་དོ།
en: I have said that, apart from one who cherishes a verse or a portion of a verse from a discourse spoken by the Tathāgata, there is nothing rarer—there should be no doubts concerning this.

source: སྤྲིན་ཆེན་པོའི་མདོ་འདིའི་ཏིང་ངེ་འཛིན་ནམ། གཟུངས་སམ། ཆོས་ཀྱི་སྒོ་གང་ཡང་རུང་བ་ལ་ང་ལ་བྱས་པ་གཟོ་བ་རྣམས་ལ་ཡང་དག་པའི་དོན་ལུང་བསྟན་པས་ལུང་བསྟན་ཏེ།
en: Whoever shows gratitude toward me for the samādhis, dhāraṇīs, or Dharma gateways taught in this Great Cloud discourse will receive a genuine prophecy.
